/*
p	n				d
1	Lietadlová loï	5
2	Bitevná loï		4
3	Krížnik			3
2	Torpédoborec	2
1	Ponorka			1
*/


#include "helpers.h"

int shipsTotal = 27;

int deployment_grid[GRID_SIZE][GRID_SIZE] = {
    { 5, 0, 0, 0, 4, 4, 4, 0, 0, 0},
    { 5, 0, 3, 0, 0, 0, 0, 0, 0, 0},
    { 5, 0, 3, 0, 1, 1, 1, 1, 1, 0},
    { 0, 0, 3, 0, 0, 0, 0, 0, 0, 0},
    { 7, 0, 3, 0, 0, 0, 0, 0, 0, 0},
    { 7, 0, 0, 0, 0, 0, 8, 8, 0, 0},
    { 0, 0, 0, 2, 0, 0, 0, 0, 0, 0},
    { 6, 0, 0, 2, 0, 0, 0, 0, 0, 0},
    { 6, 0, 0, 2, 0, 0, 0, 0, 0, 0},
    { 6, 0, 0, 2, 0, 0, 0, 0, 0, 9},
};